[
  {
    "type" : "textarea",
    "label" : "Opis przestrzeni",
    "model" : "lobbyDesc",
    "desc" : "Postaraj się opisać przestrzeń w taki sposób, by osoba z niepełnosprawnością wzroku miała orientację, czego może się spodziewać. Opisz gdzie szukać schodów, windy, punktu obsługi klienta, łazienki i podobnych elementów. Ostrzeż przed niebezpiecznymi elementami, na przykład kolejnymi schodkami w środku, śliską podłogą, wystającymi elementami."
  },
  {
    "type" : "bool",
    "label" : "Plan dotykowy rozmieszczenia pomieszczeń znajduje się [text]",
    "model" : "isTactilePlan",
    "binding" : {
      "text" : {
        "type" : "textarea",
        "label" : "opis lokalizacji palnu dotykowego",
        "model" : "isTactilePlanDesc"
      }
    },
    "desc" : "Jeżeli w przestrzeni znajduje się plan rozmieszczenia pomieszczeń w postaci dotykowej, zaznacz to pole i uzupełnij opis. Dzięki temu osoba niewidoma będzie mogła go znaleźć."
  },
  {
    "type" : "bool",
    "label" : "Plan rozmieszczenia pomieszczeń znajduje się w [text] i jest wykonany w kontrastowych kolorach oraz dużymi czcionkami.",
    "model" : "isLargePrintPlan",
    "binding" : {
      "text" : {
        "type" : "text",
        "label" : "opis lokalizacji palnu rozmieszczeń",
        "model" : "isLargePrintPlanDesc"
      }
    },
    "desc" : "Zaznacz to pole i uzupełnij opis, jeżeli w pomieszczeniu jest plan rozmieszczenia pomieszczeń wykonany w kontrastowej kolorystyce i za pomocą dużych znaków."
  },
  {
    "type" : "bool",
    "label" : "W pomieszczeniu zamontowany jest system dźwiękowy [text]",
    "model" : "isAudioInformationSystem",
    "binding" : {
      "text" : {
        "type" : "text",
        "label" : "Rodzaj systemu dźwiękowego",
        "model" : "isAudioInformationSystemDesc"
      }
    },
    "desc" : "Zaznacz to pole, jeżeli w pomieszczeniu znajduje się jakiś system informacji głosowej, na przykład Totupoint. Podaj jego nazwę, żeby odwiedzający wiedzieli, jakiej aplikacji mobilnej lub aktywatora mają używać."
  },
  {
    "type" : "bool",
    "label" : "Ścieżka dotykowa prowadzi do [text]",
    "model" : "hasTactileGuideStrips",
    "binding" : {
      "text" : {
        "type" : "text",
        "label" : "Gdzie kieruje ścieżka dotykowa",
        "model" : "hasTactileGuideStripsDesc"
      }
    },
    "desc" : "Zaznacz to pole, jeżeli w pomieszczeniu znajduje się dotykowa ścieżka prowadząca dla osób niewidomych. Uzupełnij opis, żeby osoby niewidome wiedziały, dokąd dojdą korzystając z e ścieżki, na przykład \"do windy\", \"do recepcji\"."
  },
  {
    "type" : "bool",
    "label" : "Przestrzeń jest zazwyczaj cicha i spokojna.",
    "model" : "isQuiet",
    "desc" : "Zaznacz to pole, jeżeli w tym pomieszczeniu jest cicho i mało ludzi. W każdym miejscu może być czasem głośniej, ale tu zdecyduj o tym, jak jest najczęściej. Cicha przestrzeń pomaga osobom ze spektrum autyzmu i słabosłyszącym."
  },
  {
    "type" : "bool",
    "label" : "Pomieszczenie jest dobrze oświetlone.",
    "model" : "isWellLit",
    "desc" : "Zaznacz to pole, jeżeli w pomieszczeniu jest dość światła i nie panuje w nim ciemność. Oceń to subiektywnie lub zmierz poziom oświetlenia za pomocą światłomierza. Pomiar powinien być wykonany po zmroku, przy włączonym sztucznym oświetleniu."
  },
  {
    "type" : "bool",
    "label" : "Punkt obsługi znajduje się [text]",
    "model" : "customerServiceLocation",
    "binding" : {
      "text" : {
        "type" : "text",
        "label" : "Gdzie znajduje się punkt obsługi.",
        "model" : "customerServiceLocationDesc"
      }
    },
    "desc" : "Zaznacz to pole, jeżeli w pomieszczeniu znajduje się jakiś punkt obsługi klienta, na przykład kasa, informacja, recepcja lub podobne miejsce. Uzupełnij opis w taki sposób, by każdy mógł łatwo je odnaleźć, na przykład \"na wprost wejścia, w odległości około 10 metrów.\""
  },
  {
    "type" : "bool",
    "label" : "Punkt obsługi wyposażony jest w pętlę indukcyjną. ",
    "model" : "hasInductionLoop",
    "desc" : "Zaznacz to pole, jeżeli w punkcie obsługi jest zainstalowana i działająca petla indukcyjna. Pamiętaj, że powinna być ona także oznakowana."
  },
  {
    "type" : "bool",
    "label" : "W punkcie obsługi dostępna jest usługa tłumaczenia na język migowy.",
    "model" : "hasSignLanguageInterpretation",
    "desc" : "Zaznacz to pole, jeżeli w punkcie obsługi klienta można skorzystać z tłumaczenia na język migowy. Dotyczy to bezpośredniej obsługi lub usługi tłumaczenia online, za pomocą komputera lub tabletu."
  },
  {
    "type" : "bool",
    "label" : "Blat jest obniżony i może do niego podjechać osoba na wózku.",
    "model" : "isDeskProperHeight",
    "desc" : "Zaznacz to pole, jeżeli w punkcie obsługi lada jest obniżona do takiego poziomu, że może z niego korzystać osoba na wózku lub nisłorosła. Możesz zaznaczyć także wówczas, gdy punkt obsługi to zwykły stolik o standardowej wysokości."
  }
]
